app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `lowongan`
SELECT COUNT(*) AS `numrows`
FROM `data`
SELECT COUNT(*) AS `numrows`
FROM `alternatives`
---
    public function dashboard()
    {
        // 1. Panggil Model
        $lowonganModel     = new LowonganModel();
        $dataModel         = new DataModel();
        $alternativesModel = new AlternativesModel();

        // 2. Hitung Statistik (Untuk 4 Kartu di Atas)
        $totalLowongan  = $lowonganModel->countAllResults();
        $totalPelamar   = $dataModel->countAllResults(); // Total semua pelamar (masuk & arsip)
        $totalKaryawan  = $alternativesModel->countAllResults(); // Total di tabel Alternatives

SELECT COUNT(*) AS `numrows`
FROM `lowongan`
---
            ->findAll(3);

        // 5. Kirim Data ke View
        $data = [
            'title'          => 'Dashboard Admin',
            'user_name'      => session()->get('name') ?? 'Admin', // Ambil nama dari Session Login
            'stats' => [
                'lowongan' => $totalLowongan,
                'pelamar'  => $totalPelamar,
                'karyawan' => $totalKaryawan,
                'pending'  => $butuhTindakan
            ],
            'recent_pelamar' => $pelamarTerbaru,
            'recent_jobs'    => $lowonganBaru
        ];