app/Controllers/AdminController.php

    public function dashboard()
    {
        $lowonganModel     = new LowonganModel();
        $dataModel         = new DataModel();
        $alternativesModel = new AlternativesModel();
        // Load PelamarModel untuk menghitung total orang (bukan total lamaran)
        $pelamarModel      = new \App\Models\PelamarModel();

        // Ambil data admin yang sedang login
        $adminId   = session()->get('id');
        $adminData = $this->adminModel->find($adminId);
        $namaAdmin = $adminData ? $adminData['name'] : 'Administrator';

        // Statistik Dashboard
        $stats = [
            'lowongan' => $lowonganModel->countAllResults(),
            // Hitung total pelamar unik dari tabel Master Pelamar
            'pelamar'  => $pelamarModel->countAllResults(),
            'karyawan' => $alternativesModel->countAllResults(),
            'pending'  => $dataModel->where('status', 'proses')->where('is_history', 0)->countAllResults()
        ];

        // Tabel & List Pelamar Terbaru
        // PERBAIKAN: Tambahkan JOIN ke tabel 'pelamar' dan ambil 'nama_lengkap' sebagai 'nama'
        $pelamarTerbaru = $dataModel->select('data.*, lowongan.judul_lowongan, pelamar.nama_lengkap as nama')
            ->join('lowongan', 'lowongan.id = data.id_lowongan')
            ->join('pelamar', 'pelamar.id = data.pelamar_id') // <--- JOIN PENTING
            ->orderBy('data.id', 'DESC')
            ->findAll(5); // Batasi 5 saja biar tidak berat

        $lowonganBaru = $lowonganModel->orderBy('tanggal_posting', 'DESC')->findAll(3);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `data`
WHERE `status` = 'proses'
AND `is_history` = 0
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
SELECT COUNT(*) AS `numrows`
FROM `alternatives`
SELECT `data`.*, `lowongan`.`judul_lowongan`, `pelamar`.`nama_lengkap` as `nama`
FROM `data`
JOIN `lowongan` ON `lowongan`.`id` = `data`.`id_lowongan`
JOIN `pelamar` ON `pelamar`.`id` = `data`.`pelamar_id`
ORDER BY `data`.`id` DESC
 LIMIT 5
SELECT *
FROM `lowongan`
ORDER BY `tanggal_posting` DESC
 LIMIT 3

    public function countPelamar()
    {
        $pelamarModel = new DataModel();
        $count = $pelamarModel->where('is_history', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `data`
WHERE `is_history` = 0

    public function akunIndex()
    {
        // Cek Role (Hanya Super Admin)
        if (session()->get('role') !== 'Super Admin') {
            return redirect()->to('admin/dashboard')->with('error', 'Akses ditolak.');
        }

        $data = [
            'title' => 'Manajemen Akun',
            'users' => $this->adminModel->orderBy('id', 'DESC')->findAll()
---
SELECT *
FROM `admin`
ORDER BY `id` DESC

    public function akunUpdate($id)
    {
        $data = [
            'id'       => $id,
            'name'     => $this->request->getPost('name'),
            'username' => $this->request->getPost('username'),
            'role'     => $this->request->getPost('role'),
        ];

        // Update password jika diisi
        $pass = $this->request->getPost('password');
        if (!empty($pass)) {
            $data['password'] = $pass;
        }

        $this->adminModel->save($data);
---
UPDATE `admin` SET `name` = 'superadmin', `username` = 'superadmin', `role` = 'Super Admin', `password` = '$2y$10$6Y.TvLQ7EFQV9SNLGEL/MeEO7rdUzXb4tg7.ovWeGERAdKeNcgVyC', `updated_at` = '2025-12-09 02:49:15'
WHERE `admin`.`id` IN ('1')