app/Controllers/AlternativesController.php

SELECT `alternatives`.*, `pekerjaan`.`divisi`, `pekerjaan`.`posisi`
FROM `alternatives`
LEFT JOIN `pekerjaan` ON `pekerjaan`.`id` = `alternatives`.`pekerjaan_id`
ORDER BY `alternatives`.`id` DESC
---
    public function index()
    {
        // Join ke tabel pekerjaan
        $data = $this->alternativesModel
            ->select('alternatives.*, pekerjaan.divisi, pekerjaan.posisi')
            ->join('pekerjaan', 'pekerjaan.id = alternatives.pekerjaan_id', 'left')
            ->orderBy('alternatives.id', 'DESC')
            ->findAll();