app/Controllers/AuthController.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function doLogin()
    {
        $session = session();
        $model   = new AdminModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $model->where('username', $username)->first();