app/Controllers/DataController.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        $diproses = $this->dataModel
            ->select('data.*, lowongan.judul_lowongan')
            ->join('lowongan', 'lowongan.id = data.id_lowongan')
            ->groupStart()
                ->where('data.is_history', 0)
                ->orWhere('data.is_history', null)
            ->groupEnd()
            ->orderBy('data.id', 'DESC')
            ->findAll();
---
SELECT `data`.*, `lowongan`.`judul_lowongan`
FROM `data`
JOIN `lowongan` ON `lowongan`.`id` = `data`.`id_lowongan`
WHERE   (
`data`.`is_history` = 0
OR `data`.`is_history` IS NULL
 )
ORDER BY `data`.`id` DESC