app/Controllers/DataController.php

SELECT *
FROM `pekerjaan`
GROUP BY `divisi`
ORDER BY `divisi` ASC
SELECT `data`.*, `pelamar`.`nama_lengkap`, `lowongan`.`judul_lowongan`
FROM `data`
JOIN `pelamar` ON `pelamar`.`id` = `data`.`pelamar_id`
JOIN `lowongan` ON `lowongan`.`id` = `data`.`id_lowongan`
WHERE `data`.`spk_score` > 0
AND `data`.`is_history` = 0
ORDER BY `data`.`spk_score` DESC
SELECT `data`.*, `pelamar`.`nama_lengkap`, `lowongan`.`judul_lowongan`, `pekerjaan`.`divisi`
FROM `data`
JOIN `pelamar` ON `pelamar`.`id` = `data`.`pelamar_id`
JOIN `lowongan` ON `lowongan`.`id` = `data`.`id_lowongan`
JOIN `pekerjaan` ON `pekerjaan`.`id` = `lowongan`.`pekerjaan_id`
WHERE `data`.`spk_score` = 0
AND `data`.`is_history` = 0
ORDER BY `data`.`id` DESC
SELECT `data`.*, `pelamar`.`nama_lengkap`, `lowongan`.`judul_lowongan`, `pekerjaan`.`divisi`
FROM `data`
JOIN `pelamar` ON `pelamar`.`id` = `data`.`pelamar_id`
JOIN `lowongan` ON `lowongan`.`id` = `data`.`id_lowongan`
JOIN `pekerjaan` ON `pekerjaan`.`id` = `lowongan`.`pekerjaan_id`
WHERE `data`.`spk_score` > 0
AND `data`.`is_history` = 0
ORDER BY `data`.`spk_score` DESC
---
    public function index()
    {
        // 1. AMBIL FILTER DARI URL
        $divisiFilter = $this->request->getGet('divisi');

        // 2. AMBIL LIST DIVISI (UNTUK DROPDOWN)
        // Pastikan load PekerjaanModel di construct
        $divisiList = $this->pekerjaanModel->groupBy('divisi')->orderBy('divisi', 'ASC')->findAll();

        // --- HELPER FUNCTION UNTUK FILTER ---
        $applyFilter = function($builder) use ($divisiFilter) {
            if ($divisiFilter && $divisiFilter != 'all') {
                $builder->where('pekerjaan.divisi', $divisiFilter);
            }
            return $builder;
        };

        // 3. QUERY DATA DENGAN FILTER

        // A. Pelamar Baru
        $builder1 = $this->dataModel
            ->select('data.*, pelamar.nama_lengkap, lowongan.judul_lowongan, pekerjaan.divisi')
            ->join('pelamar', 'pelamar.id = data.pelamar_id')
            ->join('lowongan', 'lowongan.id = data.id_lowongan')
            ->join('pekerjaan', 'pekerjaan.id = lowongan.pekerjaan_id') // Join ke Pekerjaan
            ->where('data.spk_score', 0)
            ->where('data.is_history', 0);

        $belumDinilai = $applyFilter($builder1)->orderBy('data.id', 'DESC')->findAll();

        // B. Hasil Penilaian
        $builder2 = $this->dataModel
            ->select('data.*, pelamar.nama_lengkap, lowongan.judul_lowongan, pekerjaan.divisi')
            ->join('pelamar', 'pelamar.id = data.pelamar_id')
            ->join('lowongan', 'lowongan.id = data.id_lowongan')
            ->join('pekerjaan', 'pekerjaan.id = lowongan.pekerjaan_id')
            ->where('data.spk_score >', 0)
            ->where('data.is_history', 0);

SELECT `data`.*, `pelamar`.`nama_lengkap`, `lowongan`.`judul_lowongan`, `pekerjaan`.`divisi`
FROM `data`
JOIN `pelamar` ON `pelamar`.`id` = `data`.`pelamar_id`
JOIN `lowongan` ON `lowongan`.`id` = `data`.`id_lowongan`
JOIN `pekerjaan` ON `pekerjaan`.`id` = `lowongan`.`pekerjaan_id`
WHERE `data`.`is_history` = 1
ORDER BY `data`.`id` DESC
---
        $sudahDinilai = $applyFilter($builder2)->orderBy('data.spk_score', 'DESC')->findAll();

        // C. History
        $builder3 = $this->dataModel
            ->select('data.*, pelamar.nama_lengkap, lowongan.judul_lowongan, pekerjaan.divisi')
            ->join('pelamar', 'pelamar.id = data.pelamar_id')
            ->join('lowongan', 'lowongan.id = data.id_lowongan')
            ->join('pekerjaan', 'pekerjaan.id = lowongan.pekerjaan_id')
            ->where('data.is_history', 1);

SELECT *
FROM `pelamar`
WHERE `is_blacklisted` = 1
ORDER BY `updated_at` DESC
---
        $history = $applyFilter($builder3)->orderBy('data.id', 'DESC')->findAll();

        // D. Blacklist (Tidak perlu filter divisi karena global)
        $blacklist = $this->pelamarModel
            ->where('is_blacklisted', 1)
            ->orderBy('updated_at', 'DESC')
            ->findAll();

SELECT `data`.*, `pelamar`.`nama_lengkap`, `pelamar`.`no_ktp`, `pelamar`.`email`, `pelamar`.`no_hp`, `pelamar`.`foto_profil`, `pelamar`.`file_cv`, `lowongan`.`judul_lowongan`, `pekerjaan`.`posisi` as `nama_pekerjaan`, `pekerjaan`.`standar_spk`
FROM `data`
JOIN `pelamar` ON `pelamar`.`id` = `data`.`pelamar_id`
JOIN `lowongan` ON `lowongan`.`id` = `data`.`id_lowongan`
JOIN `pekerjaan` ON `pekerjaan`.`id` = `lowongan`.`pekerjaan_id`
WHERE `data`.`id` = '1'
SELECT *
FROM `alternatives`
WHERE `pelamar_id` = '1'
 LIMIT 1
---
    public function detail($id)
    {
        // 1. Ambil Data Lengkap
        $pelamar = $this->dataModel
            ->select('data.*,
                      pelamar.nama_lengkap, pelamar.no_ktp, pelamar.email, pelamar.no_hp, pelamar.foto_profil, pelamar.file_cv,
                      lowongan.judul_lowongan,
                      pekerjaan.posisi as nama_pekerjaan, pekerjaan.standar_spk')
            ->join('pelamar', 'pelamar.id = data.pelamar_id')
            ->join('lowongan', 'lowongan.id = data.id_lowongan')
            ->join('pekerjaan', 'pekerjaan.id = lowongan.pekerjaan_id')
            ->find($id);

        if (!$pelamar) return redirect()->to('admin/data');

        // 2. Cek apakah sudah direkrut jadi karyawan?
        $isRekrut = $this->alternativesModel->where('pelamar_id', $pelamar['pelamar_id'])->first();