app/Controllers/FormulirController.php

SELECT *
FROM `formulir`
---
    public function index()
    {
        $data = [
            'title'    => 'Kelola Template Formulir',
            'formulir' => $this->formulirModel->findAll()