app/Controllers/LandingController.php

    public function index()
    {
        $data = [
            'title'    => 'Beranda | Karir',
            'lowongan' => $this->lowonganModel->where('status', 'open')->orderBy('tanggal_posting', 'DESC')->findAll(),
---
SELECT *
FROM `lowongan`
WHERE `status` = 'open'
ORDER BY `tanggal_posting` DESC