app/Controllers/LandingController.php

    public function index()
    {
        $data = [
            'title' => 'Beranda | SPK Rekrutmen',
            'lowongan' => $this->lowonganModel->orderBy('tanggal_posting', 'DESC')->findAll(),
---
SELECT *
FROM `lowongan`
ORDER BY `tanggal_posting` DESC

    public function detail($id)
    {
        $lowonganModel = new \App\Models\LowonganModel();

        // Join ke tabel formulir untuk ambil config pertanyaan
        $lowongan = $lowonganModel
            ->select('lowongan.*, formulir.config as form_config') // Ambil config dari tabel formulir
            ->join('formulir', 'formulir.id = lowongan.formulir_id', 'left')
            ->find($id);
---
SELECT `lowongan`.*, `formulir`.`config` as `form_config`
FROM `lowongan`
LEFT JOIN `formulir` ON `formulir`.`id` = `lowongan`.`formulir_id`
WHERE `lowongan`.`id` = '19'

    public function submit()
    {
        // 1. Validasi Input
        // Pastikan kurung kurawal validasi tertutup dengan benar
        if (!$this->validate([
            'nama'        => 'required',
            'email'       => 'required|valid_email',
            'no_hp'       => 'required',
            'link'        => 'required', // Wajib nama field 'link'
            'id_lowongan' => 'required'
        ])) {
            // Jika validasi gagal, kembalikan ke halaman sebelumnya
            return redirect()->back()->withInput()->with('error', 'Gagal mengirim! Mohon lengkapi data.');
        }

        // 2. Simpan ke Database
        $answers = $this->request->getPost('custom_answers');
        $jsonAnswers = !empty($answers) ? json_encode($answers) : null;

        // 2. Simpan
        $this->dataModel->save([
            'id_lowongan' => $this->request->getPost('id_lowongan'),
            'nama'        => $this->request->getPost('nama'),
            'email'       => $this->request->getPost('email'),
            'no_hp'       => $this->request->getPost('no_hp'),
            'link'        => $this->request->getPost('link'),
            'pesan'       => $this->request->getPost('pesan'),

            'form_data'   => $jsonAnswers, // <-- Simpan Jawaban di sini
            'status'      => 'proses'
        ]);
---
INSERT INTO `data` (`id_lowongan`, `nama`, `email`, `no_hp`, `link`, `pesan`, `form_data`, `status`) VALUES ('13', 'admin', 'admin@mail.com', '123456789', 'https://drive.google.com/drive/folders/1Uez6A99RZweOWPLM7Z0ZqvhTcQsfr8Hl?usp=drive_link', 'asasadxad', '{\"Apakah anda siap untuk mutasi\":\"bisa akan tetapi\",\"berikan alasannya\":\"rumah jauh\"}', 'proses')