app/Controllers/LowonganController.php

SELECT *
FROM `pekerjaan`
GROUP BY `divisi`
ORDER BY `divisi` ASC
SELECT `lowongan`.*, `pekerjaan`.`divisi`, `pekerjaan`.`posisi`, COUNT(data.id) as jumlah_pelamar
FROM `lowongan`
JOIN `pekerjaan` ON `pekerjaan`.`id` = `lowongan`.`pekerjaan_id`
LEFT JOIN `data` ON `data`.`id_lowongan` = `lowongan`.`id`
GROUP BY `lowongan`.`id`
ORDER BY `lowongan`.`id` DESC
---
    public function index()
    {
        $divisiFilter = $this->request->getGet('field');

        // 1. Ambil Daftar Divisi Unik untuk Dropdown Filter
        // Menggunakan 'divisi' sesuai struktur baru
        $divisiList = $this->pekerjaanModel->groupBy('divisi')->orderBy('divisi', 'ASC')->findAll();

        // 2. Setup Query dengan Join ke Tabel Pekerjaan
        $builder = $this->lowonganModel->select('lowongan.*, pekerjaan.divisi, pekerjaan.posisi, COUNT(data.id) as jumlah_pelamar');
        $builder->join('pekerjaan', 'pekerjaan.id = lowongan.pekerjaan_id');
        $builder->join('data', 'data.id_lowongan = lowongan.id', 'left');
        $builder->groupBy('lowongan.id');

        // 3. Filter Logic
        if ($divisiFilter && $divisiFilter != 'all') {
            $builder->where('pekerjaan.divisi', $divisiFilter);
        }

        $lowongan = $builder->orderBy('lowongan.id', 'DESC')->findAll();

SELECT *
FROM `lowongan`
WHERE `lowongan`.`id` = '10'
SELECT *
FROM `pekerjaan`
WHERE `pekerjaan`.`id` = '2'
SELECT *
FROM `data`
WHERE `id_lowongan` = '10'
ORDER BY `id` DESC
---
    public function detail($id)
    {
        // Cari lowongan
        $lowongan = $this->lowonganModel->find($id);
        if (!$lowongan) {
            return redirect()->to('admin/lowongan')->with('error', 'Lowongan tidak ditemukan.');
        }

        // Ambil nama pekerjaan manual (Join manual karena find() default CI4 tidak join)
        // Menggunakan 'pekerjaan_id'
        $pk = $this->pekerjaanModel->find($lowongan['pekerjaan_id']);

        // Gabungkan Divisi dan Posisi untuk tampilan
        $lowongan['nama_pekerjaan'] = $pk ? ($pk['divisi'] . ' - ' . $pk['posisi']) : '-';

        // Ambil pelamar berdasarkan id_lowongan
        $pelamar = $this->dataModel
            ->where('id_lowongan', $id)
            ->orderBy('id', 'DESC')
            ->findAll();